<a href="https://colab.research.google.com/github/barkle2/Programming/blob/master/%5BPython%5D%20Tutorial/Pandas_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import pandas as pd

In [22]:
df = pd.read_csv('https://raw.githubusercontent.com/barkle2/Programming/master/%5BPython%5D%20Tutorial/friends.csv')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

## DataFrame 행, 열 선택 및 필터

In [ ]:
# 1, 2번 행만 선택하기
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [ ]:
# 특정 행만 선택하기
select_list = [0,2]
df.loc[select_list]

   name  age      job
0  John   20  student
2  Nate   30  teacher

In [ ]:
# 조건으로 선택하기
df[df.age > 25]
df.query('age>25')

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager

In [ ]:
# 다중 조건
df[ (df.age>25) & (df.name=='Nate')]

   name  age      job
2  Nate   30  teacher

In [ ]:
# index로 컬럼 필터링
df.iloc[1:5, 0:2]

    name  age
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45

In [ ]:
# name으로 컬럼 필터링
df[['name', 'age']]
df.filter(items=['age', 'job'])

   age        job
0   20    student
1   30  developer
2   30    teacher
3   40    dentist
4   45    manager
5   25     intern

In [ ]:
# 이름에 a가 들어간 컬럼만 선택
df.filter(like='a', axis=1)

    name  age
0   John   20
1  Jenny   30
2   Nate   30
3  Julia   40
4  Brian   45
5  Chris   25

In [ ]:
# 정규표현식으로 이름이 b로 끝나는 컬럼 선택하기
df.filter(regex='b$', axis=1)

         job
0    student
1  developer
2    teacher
3    dentist
4    manager
5     intern

## DataFrame 행, 열 삭제하기

In [7]:
# 인덱스로 행 삭제하기
df.drop([2,4])
# 옵션으로 inplace=True를 추가하면 df가 변환됨
#df.drop([2,4], inplace=True)

    name  age        job
0   John   20    student
1  Jenny   30  developer
3  Julia   40    dentist
5  Chris   25     intern

In [10]:
# 열 삭제하기
df.drop('age', axis=1)
# 옵션으로 inplace=True를 추가하면 df가 변환됨
#df.drop('age', axis=1, inplace=True)

    name        job
0   John    student
1  Jenny  developer
2   Nate    teacher
3  Julia    dentist
4  Brian    manager
5  Chris     intern

## DataFrame 행, 열 생성 및 수정

In [12]:
import numpy as np

In [16]:
# 열을 생성하려면 그냥 df['생성할열이름'] 을 정의하면 된다.
# numpy의 where 함수를 사용하여 열 생성
df['salary'] = np.where(df['job'] != 'student', 'yes', 'no')
df

    name  age        job salary
0   John   20    student     no
1  Jenny   30  developer    yes
2   Nate   30    teacher    yes
3  Julia   40    dentist    yes
4  Brian   45    manager    yes
5  Chris   25     intern    yes

In [23]:
# 열 생성 예제
df['midterm'] = [80,70,75,90,30,50]
df['final'] = [40,60,80,90,70,50]
df['avg'] = (df['midterm'] + df['final']) / 2
df

    name  age        job  midterm  final   avg
0   John   20    student       80     40  60.0
1  Jenny   30  developer       70     60  65.0
2   Nate   30    teacher       75     80  77.5
3  Julia   40    dentist       90     90  90.0
4  Brian   45    manager       30     70  50.0
5  Chris   25     intern       50     50  50.0

In [28]:
# 조건에 따른 리스트를 만들어 열 생성
grades = []
for row in df['avg']:
  if row >= 90:
    grades.append('A')
  elif row >= 80:
    grades.append('B')
  elif row >= 70:
    grades.append('C')
  elif row >= 60:
    grades.append('D')
  else:
    grades.append('F')
df['grade'] = grades
df

    name  age        job  midterm  final   avg grade
0   John   20    student       80     40  60.0     D
1  Jenny   30  developer       70     60  65.0     D
2   Nate   30    teacher       75     80  77.5     C
3  Julia   40    dentist       90     90  90.0     A
4  Brian   45    manager       30     70  50.0     F
5  Chris   25     intern       50     50  50.0     F

In [29]:
# 함수를 이용하여 열 변경
def pass_or_fail(row):
  if row != 'F':
    return 'Pass'
  else:
    return 'Fail'

In [30]:
# apply(pass_or_fail) 함수로 grade 값을 변경한다.
df.grade = df.grade.apply(pass_or_fail)
df

    name  age        job  midterm  final   avg grade
0   John   20    student       80     40  60.0  Pass
1  Jenny   30  developer       70     60  65.0  Pass
2   Nate   30    teacher       75     80  77.5  Pass
3  Julia   40    dentist       90     90  90.0  Pass
4  Brian   45    manager       30     70  50.0  Fail
5  Chris   25     intern       50     50  50.0  Fail

In [32]:
# 날짜를 원소값으로 갖는 리스트 만들기
date_list = [
  { 'yyyy-mm-dd':'2000-06-27'},
  { 'yyyy-mm-dd':'2007-10-27'}
]
df = pd.DataFrame(date_list, columns = ['yyyy-mm-dd'])
df

   yyyy-mm-dd
0  2000-06-27
1  2007-10-27

In [33]:
# 연도만 추출하는 함수 만들기
def extract_year(row):
  return row.split('-')[0]

In [36]:
# apply(extract_year) 를 사용하여 연도 추출하여 year 열 생성
df['year'] = df['yyyy-mm-dd'].apply(extract_year)
df

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007

In [38]:
# DataFrame을 하나더 만들어서 합치기
date_list2 = [
  { 'yyyy-mm-dd':'2005-03-10'},
  { 'yyyy-mm-dd':'2019-11-25'}
]
df2 = pd.DataFrame(date_list2, columns=['yyyy-mm-dd'])
df2['year'] = df2['yyyy-mm-dd'].apply(extract_year)
df2

   yyyy-mm-dd  year
0  2005-03-10  2005
1  2019-11-25  2019

In [40]:
# append 함수로 df와 df2를 합친다.
df.append(df2, ignore_index=True)

   yyyy-mm-dd  year
0  2000-06-27  2000
1  2007-10-27  2007
2  2005-03-10  2005
3  2019-11-25  2019